Revit 2027 API
ReferenceIntersector.GetFilter Method
 Gets the ElementFilter used in intersection testing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementFilter GetFilter()
Public Function GetFilter As ElementFilter
public:
ElementFilter^ GetFilter()
member GetFilter : unit -> ElementFilter
Return Value
ElementFilter
 The ElementFilter, or null if no filter is set.
See Also
Reference
ReferenceIntersector Class
Autodesk.Revit.DB Namespace